import java.util.Scanner;

/*
Максимальное из N чисел
В этой задаче тебе нужно:

Ввести с клавиатуры число N.
Считать N целых чисел и заполнить ими массив array.
Найти максимальное число среди элементов массива.
*/

public class Solution {
    public static int[] array;

    public static void main(String[] args) throws Exception {
              Scanner scanner=new Scanner(System.in);
int n=scanner.nextInt();
array=new int[n];
for (int a=0;n>a;a++) {
array[a]=scanner.nextInt();
}
int max=array[0];
for (int b=0;n>b;b++) {
 if (max<array[b]) {
max=array[b];
}
}
System.out.println(max);
    }
}