import java.util.Scanner;

/*
Минимальное из N чисел
Чтобы выполнить эту задачу, тебе нужно:

Ввести с клавиатуры число N.
Считать N целых чисел и заполнить ими массив.
Найти минимальное число среди элементов массива и вывести в консоль.
*/

public class Solution {
    public static int[] array;

    public static void main(String[] args) throws Exception {
        Scanner scanner=new Scanner(System.in);
int n=scanner.nextInt();
array=new int[n];
for (int a=0;n>a;a++) {
array[a]=scanner.nextInt();
}
int min=array[0];
for (int b=0;n>b;b++) {
 if (min>array[b]) {
min=array[b];
}
}
System.out.println(min);
    }
}